In [1]:
import pandas as pd
import seaborn as sns

In [3]:
train_path = "train.csv"
data_titanic = pd.read_csv(train_path,index_col = "PassengerId")
#data_titanic.head(5)

# Context
    These data represent survivors and non-survivors from the Titanic.
    The data of the persons are charachterized by gender, age, ticket number, etc. (Total 12 columns)
    Goal/Target for data analisis is find the parametrs wich give us chance to survive Titanic or smt like that

In [17]:
data_titanic.head(10)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S
5,0,2,"Sassano, Jonathan",male,35.00,0,0,13363,6.71,NaN,S
6,0,3,"Conway, Jose",male,7.00,0,0,A/5,9.77,NaN,S
7,1,3,"Werner, Linda",female,6.00,1,2,434426,31.50,NaN,S
8,0,1,"Wardlaw, Michael",male,27.00,2,1,474849,73.02,A7253,S
9,0,2,"Greigo, Rudy",male,66.00,0,0,6981,9.14,D2969,C

# Data quality assessment
    Here we will speak about our data.

1. â€“ Cheking uniq values and data 

    1.1. As we see below,there is some nonunic name+surnames combinations.We can't drop them as they not duplicated rows.For example, here are the strings with the name "Adams, Charles".

In [4]:

titanic_unic_names = data_titanic.groupby("Name").size()
titanic_unic_names[titanic_unic_names > 1].count()
data_titanic = data_titanic.drop_duplicates()
titanic_unic_names = data_titanic.groupby("Name").size()
titanic_unic_names[titanic_unic_names > 1].count()
data_titanic[data_titanic.Name == "Adams, Charles"]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
4756,0,3,"Adams, Charles",male,43.0,0,0,448854,24.48,NaN,S
53997,0,3,"Adams, Charles",male,24.0,0,0,46829,6.19,NaN,S
65259,0,2,"Adams, Charles",male,51.0,1,1,4121045,12.23,NaN,S
73925,1,3,"Adams, Charles",male,7.0,1,0,A/5,12.69,NaN,S
83604,1,1,"Adams, Charles",male,61.0,0,0,SC/AH 423519,54.77,B11325,Q

2. â€“ Cheking Nan values and replasing them or droping

In [5]:
#data_titanic.isna().any() Cheking colum on NAN

print("Nan count by colums \n Age: "+str(len(data_titanic[data_titanic.Age.isna()])),
     "\n Ticket: " + str(len(data_titanic[data_titanic.Ticket.isna()])),
     "\n Fare: " + str(len(data_titanic[data_titanic.Fare.isna()])),
     "\n Cabin: "+ str(len(data_titanic[data_titanic.Cabin.isna()])),
     "\n Embarked: " + str(len(data_titanic[data_titanic.Embarked.isna()])),
     )

Nan count by colums
 Age: 3292
 Ticket: 4623
 Fare: 134
 Cabin: 67866
 Embarked: 250

3. â€“ Cheking colums types and changing it

In [11]:
data_titanic.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

# Data exploration

# Summary